---
kind: type
id: T:Autodesk.Revit.DB.Events.PostEventArgs
source: html/05247367-aa2f-b928-f820-c03e297d59d1.htm
---
# Autodesk.Revit.DB.Events.PostEventArgs

The class is used as a base class for arguments of any post-event.

## Syntax (C#)
```csharp
public class PostEventArgs : RevitEventArgs
```